docs: Update diagram to use mermaid
